Table of Contents
 Class IdeaConnectionPoint
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaConnectionPoint : AbstractIdeaObject<IIdeaConnectionPoint>, IEquatable<AbstractIdeaObject<IIdeaConnectionPoint>>, IIdeaConnectionPoint, IIdeaPersistentObject, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaConnectionPoint>
IdeaConnectionPoint
Implements
IEquatable<AbstractIdeaObject<IIdeaConnectionPoint>>
IIdeaConnectionPoint
IIdeaPersistentObject
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaConnectionPoint>.Id
 AbstractIdeaObject<IIdeaConnectionPoint>.Name
 AbstractIdeaObject<IIdeaConnectionPoint>.Identifier
 AbstractIdeaObject<IIdeaConnectionPoint>.GetHashCode()
 AbstractIdeaObject<IIdeaConnectionPoint>.Equals(object)
 AbstractIdeaObject<IIdeaConnectionPoint>.Equals(AbstractIdeaObject<IIdeaConnectionPoint>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaConnectionPoint(Identifier<IIdeaConnectionPoint>)
protected IdeaConnectionPoint(Identifier<IIdeaConnectionPoint> identifer)
Parameters
identifer Identifier<IIdeaConnectionPoint>
 IdeaConnectionPoint(double, double, double)
public IdeaConnectionPoint(double X, double Y, double Z)
Parameters
X double
Y double
Z double
 IdeaConnectionPoint(int)
public IdeaConnectionPoint(int id)
Parameters
id int
 IdeaConnectionPoint(string)
public IdeaConnectionPoint(string id)
Parameters
id string
Properties
 AnchorGrids
public IEnumerable<IIdeaAnchorGrid> AnchorGrids { get; set; }
Property Value
IEnumerable<IIdeaAnchorGrid>
 BoltGrids
public IEnumerable<IIdeaBoltGrid> BoltGrids { get; set; }
Property Value
IEnumerable<IIdeaBoltGrid>
 ConnectedMembers
public IEnumerable<IIdeaConnectedMember> ConnectedMembers { get; set; }
Property Value
IEnumerable<IIdeaConnectedMember>
 Cuts
public IEnumerable<IIdeaCut> Cuts { get; set; }
Property Value
IEnumerable<IIdeaCut>
 FoldedPlates
public IEnumerable<IIdeaFoldedPlate> FoldedPlates { get; set; }
Property Value
IEnumerable<IIdeaFoldedPlate>
 Node
public virtual IIdeaNode Node { get; set; }
Property Value
IIdeaNode
 Plates
public IEnumerable<IIdeaPlate> Plates { get; set; }
Property Value
IEnumerable<IIdeaPlate>
 Token
Persistence token. Holds data neccessery to recreated the object in future.
public virtual IIdeaPersistenceToken Token { get; }
Property Value
IIdeaPersistenceToken
 Welds
public IEnumerable<IIdeaWeld> Welds { get; set; }
Property Value
IEnumerable<IIdeaWeld>
 Edit this page